{
    "batter": [
        "If you got out on that one, you need to join back the school cricket academy mate",
        "Bet you only play shots on easy pitches loser",
        "You can't connect shit, better go knit clothes or something",
        "If I had a career like yours, I'd kms",
        "You got the balls to hit this for a six?",
        "My grandma plays better with her walking stick",
        "You call that batting? I've seen better technique in a kindergarten match",
        "Your batting average is lower than your IQ, and that's saying something",
        "You're so bad, even the bowling machine feels sorry for you",
        "I've seen better footwork from a statue",
        "Your bat looks heavier than your talent",
        "You couldn't hit water if you fell out of a boat",
        "Your technique belongs in a museum... of failures",
        "Even a blind bat has better hand-eye coordination",
        "Your batting makes Inzamam look like Usain Bolt",
        "You're about as useful as a screen door on a submarine",
        "I've seen better shots in a retirement home",
        "Your career is deader than your footwork",
        "You swing that bat like it's your first time holding a stick",
        "Even your shadow has better timing than you",
        "Your batting average is dropping faster than your dignity",
        "You're so bad, even your bat wants a transfer",
        "Your technique is more broken than your dreams of playing professionally",
        "You make Chris Martin look like Don Bradman"
    ],
    "bowler": [
        "My kids bowl better than you!",
        "The only bowling skill you have is shining it with a sandpaper",
        "Dinda academy or wot?",
        "You talk faster than you bowl",
        "Your bowling is so slow, snails are asking for a head start",
        "I've seen better lines at a kindergarten drawing class",
        "Your action is more questionable than your talent",
        "You couldn't hit the pitch if it was the size of an ocean",
        "Your bowling is perfect... for batting practice",
        "Even a vending machine has better accuracy",
        "Your run-up is longer than your list of wickets",
        "You're making the batsman look good... and that's hard to do",
        "Your bowling is so predictable, even the stumps are bored",
        "You couldn't spin it if you were on a merry-go-round",
        "Your bowling is more wayward than a drunk GPS",
        "You're leaking more runs than a broken tap",
        "Your bowling figures look like a phone number",
        "Even a toddler could smash your bowling",
        "Your bowling makes part-timers look like Dale Steyn",
        "You're about as threatening as a wet paper bag",
        "Your economy rate is higher than Mount Everest",
        "You bowl like you're afraid of the ball",
        "Your bowling action is more suspicious than your talent",
        "You make Jade Dernbach look like Glenn McGrath"
    ]
} 